; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=25, out_folder=htg/blocksworld//training, instance_id=5, seed=2029

(define (problem blocksworld-05)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 - object)
 (:init 
    (arm-empty)
    (clear b23)
    (on b23 b13)
    (on-table b13)
    (clear b2)
    (on b2 b18)
    (on b18 b1)
    (on-table b1)
    (clear b15)
    (on b15 b3)
    (on b3 b4)
    (on b4 b11)
    (on b11 b20)
    (on b20 b8)
    (on b8 b7)
    (on b7 b9)
    (on b9 b12)
    (on b12 b21)
    (on b21 b10)
    (on b10 b5)
    (on b5 b19)
    (on b19 b17)
    (on b17 b14)
    (on b14 b22)
    (on b22 b6)
    (on b6 b25)
    (on b25 b16)
    (on b16 b24)
    (on-table b24))
 (:goal  (and 
    (clear b1)
    (on b1 b2)
    (on-table b2))))

; plan
1. (unstack b2 b18)
   deleted: (on b2 b18) (clear b2) (arm-empty)
   added: (holding b2) (clear b18)
   goals met: 0 of 3
2. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 1 of 3
3. (unstack b18 b1)
   deleted: (on b18 b1) (clear b18) (arm-empty)
   added: (holding b18) (clear b1)
   goals met: 2 of 3
4. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 2 of 3
5. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 1 of 3
6. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 3 of 3
